
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		Покупатель = ДанныеЗаполнения.Покупатель;
		Склад = ДанныеЗаполнения.Склад;
		Для Каждого ТекСтрокаСписокПродуктов Из ДанныеЗаполнения.СписокПродуктов Цикл
			НоваяСтрока = СписокПродуктов.Добавить();
			НоваяСтрока.Количество = ТекСтрокаСписокПродуктов.Количество;
			НоваяСтрока.Товар = ТекСтрокаСписокПродуктов.Товар;
			НоваяСтрока.Стоимость = ТекСтрокаСписокПродуктов.Стоимость;
			НоваяСтрока.Цена = ТекСтрокаСписокПродуктов.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПродуктов Из СписокПродуктов Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокПродуктов.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаСписокПродуктов.Количество;
	КонецЦикла;

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПродуктов Из СписокПродуктов Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаСписокПродуктов.Товар;
		Движение.Контрагент = Покупатель;
		Движение.Сумма = ТекСтрокаСписокПродуктов.Стоимость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
